Repository: DeadSonger/gnu_dev_homeworks
Catalog: 10_Documenting/game.po
Languages: ru

source: It is a simple game "guess the number" in which you are asked to guess a number, and your adversary will try to guess it by asking you questions Usage: game [--help] [-r] Options: --help, -- print help message -r, -- use roman numbers in game Examles: game play game game -r play game using roman number
ru: Это простая игра "Угадай число", в которой вам предлагается загадать число, а ваш аппонент будет пытаться его угадать, задавая вам вопросы. Использование: game [--help] [-r] Опции: --help, -- Выводит вспомогательное сообщение -r, -- Для игры будут использоватьсяримские числа Примеры: game играть game -r играть, испоьзуя римские числа

source: Is your number over %d?
ru: Ваше число больше, чем %d?

source: Is your number over %s?
ru: Ваше число больше, чем %s?

source: Your number is %d.
ru: Вы загадали число %d.

source: Your roman number is %s.
ru: Вы загадали число %s.

source: Please guess a number from 1 to 100:
ru: Пожалуйста, загадайте число от 1 до 100:

source: yes
ru: да

source: no
ru: нет

source: Enter [%s|%s]:
ru: Введите [%s|%s]:

source: Something went wrong, are you really playing by the rules?
ru: Что-то пошло не так, вы точно играете по правилам?

source: I'm sorry, but I don't understand your answer. Let's try again.
ru: Прошу прощения, но я не многу разобрать вашего ответа. Давайте попробуем еще раз.
